"""
🧪 Лабораторная работа 2: Основы тестирования ПО

🎯 Цель: Освоить фундаментальные концепции тестирования программного обеспечения

📚 Темы:
- Типы и уровни тестирования
- Жизненный цикл тестирования (STLC)
- Создание тест-кейсов
- Тест-документация
- Основы тест-дизайна

⏱️ Время выполнения: 90-120 минут

📝 Инструкции:
1. Изучите теоретический материал
2. Выполните практические задания
3. Создайте собственные тест-кейсы
4. Проанализируйте результаты
"""

# =============================================================================
# ЗАДАНИЕ 1: Классификация типов тестирования
# =============================================================================

def test_testing_types_classification():
    """
    🎯 Задание: Классифицируйте различные типы тестирования
    
    Сценарий: Вы работаете тест-аналитиком и должны классифицировать 
    тестирование для нового веб-приложения
    """
    
    # Список видов тестирования
    testing_activities = [
        "Проверка авторизации пользователя",
        "Тестирование скорости загрузки страницы",
        "Проверка работы на мобильных устройствах",
        "Тестирование восстановления пароля",
        "Проверка безопасности API",
        "Тестирование оплаты банковской картой",
        "Проверка доступности для людей с ограниченными возможностями",
        "Тестирование интеграции с платежной системой"
    ]
    
    # TODO: Классифицируйте каждый вид тестирования
    
    # Категории:
    # - FUNCTIONAL (функциональное)
    # - NON_FUNCTIONAL (нефункциональное)
    # - MAINTENANCE (сопроводительное)
    
    classifications = {}
    
    # Пример заполнения:
    # classifications["Проверка авторизации пользователя"] = "FUNCTIONAL"
    
    # Проверки (не изменять!)
    functional_tests = [k for k, v in classifications.items() if v == "FUNCTIONAL"]
    non_functional_tests = [k for k, v in classifications.items() if v == "NON_FUNCTIONAL"]
    
    assert len(functional_tests) >= 4, "Должно быть минимум 4 функциональных теста"
    assert len(non_functional_tests) >= 2, "Должно быть минимум 2 нефункциональных теста"
    
    print("✅ Задание 1 выполнено успешно!")
    print(f"📊 Классификация: {len(functional_tests)} функциональных, {len(non_functional_tests)} нефункциональных")
    return True

# =============================================================================
# ЗАДАНИЕ 2: Жизненный цикл тестирования (STLC)
# =============================================================================

def test_stlc_phases():
    """
    🎯 Задание: Определите последовательность фаз STLC
    
    Сценарий: Вам нужно спланировать тестирование нового функционала
    """
    
    # Фазы STLC в случайном порядке
    stlc_phases_mixed = [
        "Test Execution",      # Выполнение тестов
        "Test Planning",       # Планирование тестирования
        "Test Closure",        # Завершение тестирования
        "Test Analysis",       # Анализ требований
        "Test Design",         # Проектирование тестов
        "Test Implementation"   # Реализация тестов
    ]
    
    # TODO: Расставьте фазы в правильной последовательности
    
    correct_sequence = [
        # Правильный порядок фаз STLC
    ]
    
    # Проверки (не изменять!)
    expected_sequence = [
        "Test Planning",
        "Test Analysis", 
        "Test Design",
        "Test Implementation",
        "Test Execution",
        "Test Closure"
    ]
    
    assert correct_sequence == expected_sequence, "Неправильная последовательность фаз STLC"
    
    print("✅ Задание 2 выполнено успешно!")
    return True

# =============================================================================
# ЗАДАНИЕ 3: Создание тест-кейсов
# =============================================================================

def test_create_test_cases():
    """
    🎯 Задание: Создайте тест-кейсы для формы логина
    
    Сценарий: Разработайте тест-кейсы для стандартной формы авторизации
    """
    
    # Требования к форме логина:
    # - Поля: username (email), password
    # - Кнопка: Login
    # - Валидация: email формат, минимальная длина пароля 8 символов
    # - Обработка ошибок: отображение сообщений
    
    class TestCase:
        def __init__(self, id, description, preconditions, steps, expected_result):
            self.id = id
            self.description = description
            self.preconditions = preconditions
            self.steps = steps
            self.expected_result = expected_result
    
    # TODO: Создайте минимум 5 тест-кейсов
    
    test_cases = []
    
    # Пример:
    # tc1 = TestCase(
    #     id="TC001",
    #     description="Успешная авторизация с валидными данными",
    #     preconditions=["Пользователь на странице логина"],
    #     steps=[
    #         "Ввести валидный email в поле username",
    #         "Ввести валидный пароль в поле password",
    #         "Нажать кнопку Login"
    #     ],
    #     expected_result="Пользователь успешно авторизован, перенаправлен в личный кабинет"
    # )
    # test_cases.append(tc1)
    
    # Проверки (не изменять!)
    assert len(test_cases) >= 5, "Должно быть минимум 5 тест-кейсов"
    
    # Проверка структуры
    for tc in test_cases:
        assert hasattr(tc, 'id'), "У каждого тест-кейса должен быть ID"
        assert hasattr(tc, 'description'), "У каждого тест-кейса должно быть описание"
        assert isinstance(tc.steps, list), "Шаги должны быть в виде списка"
        assert len(tc.steps) > 0, "Должны быть указаны шаги выполнения"
    
    print("✅ Задание 3 выполнено успешно!")
    print(f"📊 Создано {len(test_cases)} тест-кейсов")
    return True

# =============================================================================
# ЗАДАНИЕ 4: Тест-дизайн техники
# =============================================================================

def test_test_design_techniques():
    """
    🎯 Задание: Примените техники тест-дизайна
    
    Сценарий: Тестирование поля ввода возраста (18-99 лет)
    """
    
    # Входные данные для анализа
    age_field_spec = {
        "min_value": 18,
        "max_value": 99,
        "data_type": "integer",
        "required": True
    }
    
    # TODO: Примените различные техники тест-дизайна
    
    # 1. Эквивалентное разделение (Equivalence Partitioning)
    valid_partitions = []      # Валидные классы эквивалентности
    invalid_partitions = []    # Невалидные классы эквивалентности
    
    # 2. Граничные значения (Boundary Value Analysis)
    boundary_values = []       # Граничные значения для тестирования
    
    # 3. Таблица принятия решений (Decision Table)
    decision_scenarios = []    # Сценарии принятия решений
    
    # Проверки (не изменять!)
    assert len(valid_partitions) >= 1, "Должен быть хотя бы один валидный класс"
    assert len(invalid_partitions) >= 3, "Должно быть минимум 3 невалидных класса"
    assert len(boundary_values) >= 4, "Должно быть минимум 4 граничных значения"
    
    print("✅ Задание 4 выполнено успешно!")
    return True

# =============================================================================
# ЗАДАНИЕ 5: Оценка тестового покрытия
# =============================================================================

def test_test_coverage_calculation():
    """
    🎯 Задание: Рассчитайте тестовое покрытие
    
    Сценарий: Оценка качества тестирования нового релиза
    """
    
    # Данные о тестировании
    requirements = {
        "REQ_001": {"tested": True, "automated": True},
        "REQ_002": {"tested": True, "automated": False},
        "REQ_003": {"tested": False, "automated": False},
        "REQ_004": {"tested": True, "automated": True},
        "REQ_005": {"tested": True, "automated": False},
        "REQ_006": {"tested": False, "automated": False},
        "REQ_007": {"tested": True, "automated": True},
        "REQ_008": {"tested": False, "automated": False}
    }
    
    # TODO: Рассчитайте метрики тестового покрытия
    
    # Метрики для расчета:
    total_requirements = None           # Общее количество требований
    tested_requirements = None          # Протестированные требования
    automated_tests = None              # Автоматизированные тесты
    test_coverage_percentage = None     # Процент тестового покрытия
    automation_coverage_percentage = None  # Процент автоматизации
    
    # Проверки (не изменять!)
    assert total_requirements == 8, "Общее количество требований должно быть 8"
    assert 50 <= test_coverage_percentage <= 75, f"Покрытие должно быть 50-75%, получено {test_coverage_percentage}%"
    assert automation_coverage_percentage <= test_coverage_percentage, "Автоматизация не может быть выше общего покрытия"
    
    print("✅ Задание 5 выполнено успешно!")
    print(f"📊 Тестовое покрытие: {test_coverage_percentage}%")
    print(f"📊 Покрытие автоматизацией: {automation_coverage_percentage}%")
    return True

# =============================================================================
# ЗАДАНИЕ 6: Анализ дефектов
# =============================================================================

def test_defect_analysis():
    """
    🎯 Задание: Проанализируйте найденные дефекты
    
    Сценарий: Анализ результатов тестирования релиза
    """
    
    # Найденные дефекты
    defects = [
        {"id": "BUG-001", "severity": "HIGH", "status": "OPEN", "module": "Authentication"},
        {"id": "BUG-002", "severity": "MEDIUM", "status": "FIXED", "module": "Payment"},
        {"id": "BUG-003", "severity": "LOW", "status": "OPEN", "module": "UI"},
        {"id": "BUG-004", "severity": "CRITICAL", "status": "OPEN", "module": "Database"},
        {"id": "BUG-005", "severity": "MEDIUM", "status": "REOPENED", "module": "Authentication"},
        {"id": "BUG-006", "severity": "HIGH", "status": "CLOSED", "module": "API"},
        {"id": "BUG-007", "severity": "LOW", "status": "OPEN", "module": "Reports"}
    ]
    
    # TODO: Проанализируйте дефекты
    
    # Метрики для анализа:
    total_bugs = None              # Общее количество багов
    open_bugs = None               # Открытые баги
    critical_bugs = None           # Критические баги
    bugs_by_module = {}            # Баги по модулям
    severity_distribution = {}     # Распределение по серьезности
    
    # Проверки (не изменять!)
    assert total_bugs == 7, "Общее количество багов должно быть 7"
    assert critical_bugs >= 1, "Должен быть хотя бы один критический баг"
    assert "Authentication" in bugs_by_module, "Модуль Authentication должен быть в списке"
    
    print("✅ Задание 6 выполнено успешно!")
    return True

# =============================================================================
# Функция запуска всех заданий
# =============================================================================

def run_all_labs():
    """Запускает все лабораторные задания"""
    print("🔬 Запуск лабораторной работы 2: Основы тестирования ПО")
    print("=" * 60)
    
    try:
        test_testing_types_classification()
        test_stlc_phases()
        test_create_test_cases()
        test_test_design_techniques()
        test_test_coverage_calculation()
        test_defect_analysis()
        
        print("\n" + "=" * 60)
        print("🎉 Все задания выполнены успешно!")
        print("🏆 Вы освоили основы тестирования программного обеспечения!")
        
    except AssertionError as e:
        print(f"\n❌ Ошибка в задании: {e}")
        print("💡 Совет: Проверьте комментарии в коде и исправьте логику")
    except Exception as e:
        print(f"\n💥 Неожиданная ошибка: {e}")

# Запуск при импорте как модуля
if __name__ == "__main__":
    run_all_labs()