"""
🧪 Лабораторная работа 1: Основы синтаксиса Python для тестировщиков

🎯 Цель: Освоить базовый синтаксис Python через призму тестирования

📚 Темы:
- Переменные и типы данных
- Операторы сравнения  
- Условные выражения
- Базовые структуры данных

⏱️ Время выполнения: 60-90 минут

📝 Инструкции:
1. Выполните все задания по порядку
2. Запускайте код после каждого изменения
3. Проверяйте результаты через assert
4. Не стесняйтесь экспериментировать с кодом
"""

# =============================================================================
# ЗАДАНИЕ 1: Работа с переменными и типами данных
# =============================================================================

def test_variables_and_types():
    """
    🎯 Задание: Создайте переменные разных типов для хранения тестовых данных
    
    Создайте переменные для хранения:
    - Номера тест-кейса (целое число)
    - Названия теста (строка)
    - Ожидаемого результата (булево значение)
    - Времени выполнения теста (вещественное число)
    - Тегов теста (список строк)
    """
    
    # TODO: Создайте переменные ниже
    test_case_number = None      # Целое число
    test_name = None             # Строка
    expected_result = None       # Булево значение
    execution_time = None        # Вещественное число
    test_tags = None             # Список строк
    
    # Проверки (не изменять!)
    assert isinstance(test_case_number, int), "Номер тест-кейса должен быть целым числом"
    assert isinstance(test_name, str), "Название теста должно быть строкой"
    assert isinstance(expected_result, bool), "Ожидаемый результат должен быть булевым"
    assert isinstance(execution_time, float), "Время выполнения должно быть вещественным числом"
    assert isinstance(test_tags, list), "Теги должны быть списком"
    assert all(isinstance(tag, str) for tag in test_tags), "Все теги должны быть строками"
    
    print("✅ Задание 1 выполнено успешно!")
    return True

# =============================================================================
# ЗАДАНИЕ 2: Операторы сравнения в контексте тестирования
# =============================================================================

def test_comparison_operators():
    """
    🎯 Задание: Используйте операторы сравнения для проверки тестовых условий
    
    Сценарий: Вы тестируете функцию калькулятора
    """
    
    # Данные для тестирования
    actual_result = 42
    expected_result = 42
    tolerance = 0.01  # Для вещественных чисел
    
    # TODO: Напишите проверки с использованием операторов сравнения
    
    # Проверка точного совпадения
    is_equal = None  # actual_result == expected_result
    
    # Проверка неравенства
    is_not_equal = None  # actual_result != 50
    
    # Проверка с допустимой погрешностью (для float)
    is_close_enough = None  # abs(actual_result - expected_result) <= tolerance
    
    # Проверки (не изменять!)
    assert is_equal is True, "Результаты должны совпадать"
    assert is_not_equal is True, "Результат не должен равняться 50"
    assert is_close_enough is True, "Результаты должны быть близки с учетом погрешности"
    
    print("✅ Задание 2 выполнено успешно!")
    return True

# =============================================================================
# ЗАДАНИЕ 3: Условные выражения для тестовой логики
# =============================================================================

def test_conditional_logic():
    """
    🎯 Задание: Напишите логику определения статуса теста
    
    Сценарий: На основе результата теста определите его статус
    """
    
    # Входные данные
    test_passed = True
    has_warnings = False
    execution_time_seconds = 2.5
    max_allowed_time = 5.0
    
    # TODO: Напишите логику определения статуса
    
    # Определите статус теста:
    # - "PASSED" если тест прошел и нет предупреждений
    # - "WARNING" если тест прошел, но есть предупреждения  
    # - "FAILED" если тест не прошел
    # - "TIMEOUT" если время выполнения превышает лимит
    
    test_status = None
    
    # Проверки (не изменять!)
    if test_passed and not has_warnings:
        assert test_status == "PASSED"
    elif test_passed and has_warnings:
        assert test_status == "WARNING"
    elif not test_passed:
        assert test_status == "FAILED"
    elif execution_time_seconds > max_allowed_time:
        assert test_status == "TIMEOUT"
    
    print("✅ Задание 3 выполнено успешно!")
    return True

# =============================================================================
# ЗАДАНИЕ 4: Работа со списками для тестовых данных
# =============================================================================

def test_list_operations():
    """
    🎯 Задание: Обработайте список тест-кейсов
    
    Сценарий: Работа с коллекцией тестов
    """
    
    # Список тест-кейсов с их статусами
    test_cases = [
        {"id": 1, "name": "Login test", "status": "PASSED"},
        {"id": 2, "name": "Logout test", "status": "FAILED"},
        {"id": 3, "name": "Profile test", "status": "PASSED"},
        {"id": 4, "name": "Payment test", "status": "SKIPPED"},
        {"id": 5, "name": "Search test", "status": "PASSED"}
    ]
    
    # TODO: Выполните следующие операции:
    
    # 1. Подсчитайте общее количество тестов
    total_tests = None
    
    # 2. Найдите количество пройденных тестов (PASSED)
    passed_tests = None
    
    # 3. Создайте список имен проваленных тестов
    failed_test_names = None
    
    # 4. Проверьте, есть ли тесты со статусом SKIPPED
    has_skipped_tests = None
    
    # Проверки (не изменять!)
    assert total_tests == 5, f"Ожидалось 5 тестов, получено {total_tests}"
    assert passed_tests == 3, f"Ожидалось 3 пройденных теста, получено {passed_tests}"
    assert failed_test_names == ["Logout test"], f"Ожидался один проваленный тест"
    assert has_skipped_tests is True, "Должен быть хотя бы один пропущенный тест"
    
    print("✅ Задание 4 выполнено успешно!")
    return True

# =============================================================================
# ЗАДАНИЕ 5: Интеграционное задание - Система отчетности
# =============================================================================

def test_reporting_system():
    """
    🎯 Задание: Создайте простую систему генерации отчета о тестировании
    
    Сценарий: Генерация сводного отчета по результатам тестирования
    """
    
    # Данные о тестировании
    project_name = "E-commerce App"
    total_test_cases = 150
    passed_cases = 135
    failed_cases = 10
    skipped_cases = 5
    
    # TODO: Создайте отчет
    
    # Рассчитайте:
    pass_rate = None  # Процент пройденных тестов
    execution_summary = None  # Сводка в формате строки
    
    # Проверки (не изменять!)
    expected_pass_rate = 90.0  # 135/150 * 100
    assert abs(pass_rate - expected_pass_rate) < 0.01, f"Ожидался pass rate {expected_pass_rate}%, получено {pass_rate}%"
    
    expected_summary = "Project: E-commerce App | Total: 150 | Passed: 135 | Failed: 10 | Skipped: 5 | Pass Rate: 90.0%"
    assert execution_summary == expected_summary, "Сводка не соответствует ожидаемому формату"
    
    print("✅ Задание 5 выполнено успешно!")
    print(f"\n📊 Тестовый отчет:")
    print(f"   {execution_summary}")
    return True

# =============================================================================
# Функция запуска всех заданий
# =============================================================================

def run_all_labs():
    """Запускает все лабораторные задания"""
    print("🔬 Запуск лабораторной работы 1: Основы синтаксиса Python")
    print("=" * 60)
    
    try:
        test_variables_and_types()
        test_comparison_operators()
        test_conditional_logic()
        test_list_operations()
        test_reporting_system()
        
        print("\n" + "=" * 60)
        print("🎉 Все задания выполнены успешно!")
        print("🏆 Вы освоили базовый синтаксис Python для тестирования!")
        
    except AssertionError as e:
        print(f"\n❌ Ошибка в задании: {e}")
        print("💡 Совет: Проверьте комментарии в коде и исправьте переменные")
    except Exception as e:
        print(f"\n💥 Неожиданная ошибка: {e}")

# Запуск при импорте как модуля
if __name__ == "__main__":
    run_all_labs()